# ItemData Class

---
Base class used to contain information necessary to construct RibbonItem and ContextMenuItem
SystemObject Autodesk.Revit.UIItemData Autodesk.Revit.UIRibbonItemData
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class ItemData : IDisposable

    Public Class ItemData
    	Implements IDisposable

    public ref class ItemData : IDisposable

    type ItemData =
        class
            interface IDisposable
        end
The ItemData type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Name|  The internal name of the item.
| ToolTip|  The tooltip of item.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the ItemData
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.UI Namespace